Documents/бит_НачислениеПениПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_НачислениеПениПоЛицевымСчетам</Name>
			<BasedOn>
				<xr:Item>Document.бит_ОплатаКУ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачислениеПениПоПериодам</xr:Item>
				<xr:Item>InformationRegister.бит_ДопДанныеНачисленияПени</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачислениеПениПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытиеПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПениПоПериодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Долг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисленияПени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПениПоУслугамЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ДопДанныеНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ДопДанныеНачисленияПени</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_НачислениеПениПоЛицевымСчетам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункцииДокумента

// Процедура производит расчеты. 
// И заполняет табличную часть.
//
Процедура РассчитатьНачисленияПениПоЛицевымСчетам(СписокЛС, СсылкаОС = Неопределено) Экспорт 
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачислятьПени"                , Ложь);
	СтруктураПараметров.Вставить("НачислятьПениСУчетомПереплаты", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, СтруктураПараметров);
	
	ЛицевыеСчета.Очистить();
	
	Если НЕ СтруктураПараметров.НачислятьПени Тогда
		
		ШаблоСообщения = НСтр("ru='В настройках %1 от %2 начисление пени отключено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблоСообщения, Организация, Формат(Дата, "ДФ=dd.MM.yyyy")));
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей >= ДЕНЬ(&Дата)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1 - бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|	КОНЕЦ КАК Момент,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|			КОНЕЦ >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|							ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|					КОНЕЦ, КОНЕЦПЕРИОДА(ВЫБОР
	|							КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|								ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|						КОНЕЦ, МЕСЯЦ), ДЕНЬ) + ДЕНЬ(&Дата)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|						ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|				КОНЕЦ, &Дата, ДЕНЬ)
	|	КОНЕЦ КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";

	Запрос.УстановитьПараметр("Дата"        , Дата);
	Запрос.УстановитьПараметр("Организация" , Организация);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Момент			= Выборка.Момент;
		КоличествоДней	= Выборка.КоличествоДней;
	Иначе
		ТекстСообщения = НСтр("ru = 'Настройте параметры ЖКХ для организации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаЛС
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В (&СписокЛС)
	|				И НЕ ЛицевойСчет.ПометкаУдаления
	|				И НЕ ЛицевойСчет.Архивный) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	НЕ бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.НеВестиРасчетПени
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней + 1), ДЕНЬ) КАК Период,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 999) КАК КоличествоМесяцев,
	|	бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления КАК ПериодНачисленияПени,
	|	бит_ПениПоУслугамЖКХСрезПоследних.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХСрезПоследних.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХСрезПоследних.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Процент
	|ПОМЕСТИТЬ ВсеПроценты
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней), Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бит_ПениПоУслугамЖКХ.Период, ДЕНЬ),
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХ.ПериодНачисления.КоличествоМесяцев, 999),
	|	бит_ПениПоУслугамЖКХ.ПериодНачисления,
	|	бит_ПениПоУслугамЖКХ.Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХ.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХ.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ КАК бит_ПениПоУслугамЖКХ
	|ГДЕ
	|	бит_ПениПоУслугамЖКХ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней) И &Дата
	|	И бит_ПениПоУслугамЖКХ.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВсеПроценты.Период) КАК Период,
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга КАК Услуга,
	|	ВсеПроценты.Процент КАК Процент
	|ПОМЕСТИТЬ ИтоговаяПроценты
	|ИЗ
	|	ВсеПроценты КАК ВсеПроценты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга,
	|	ВсеПроценты.Процент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Услуга,
	|	ВсеПроценты.КоличествоМесяцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеПроценты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга КАК Услуга,
	|	ИтоговаяПроценты.Период КАК Период,
	|	ИтоговаяПроценты.Процент КАК Процент,
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) КАК КоличествоДней
	|ПОМЕСТИТЬ ИтоговаТаблица
	|ИЗ
	|	ИтоговаяПроценты КАК ИтоговаяПроценты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяПроценты КАК ИтоговаяПроцентыРазность
	|		ПО ИтоговаяПроценты.Услуга = ИтоговаяПроцентыРазность.Услуга
	|			И ИтоговаяПроценты.КоличествоМесяцев = ИтоговаяПроцентыРазность.КоличествоМесяцев
	|			И ИтоговаяПроценты.Период < ИтоговаяПроцентыРазность.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяПроценты.Период,
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга,
	|	ИтоговаяПроценты.Процент
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет КАК ЛС,
	|	ИтоговаТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаТаблица.ПериодНачисленияПени КАК ПериодНачисленияПени,
	|	ИтоговаТаблица.Услуга КАК Услуга,
	|	ЕСТЬNULL(ИтоговаТаблица.Процент, 0) КАК ПроцентПени,
	|	ИтоговаТаблица.КоличествоДней КАК КоличествоДней,
	|	ТаблицаЛС.Наименование КАК Наименование,
	|	ИтоговаТаблица.Услуга.Приоритет КАК Приоритет
	|ИЗ
	|	ТаблицаЛС КАК ТаблицаЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаТаблица КАК ИтоговаТаблица
	|		ПО ТаблицаЛС.Услуга = ИтоговаТаблица.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ,
	|	Наименование,
	|	Приоритет
	|ИТОГИ ПО
	|	ЛС,
	|	КоличествоМесяцев";
	
	Запрос.УстановитьПараметр("Дата"        	, Дата);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("КоличествоДней"	, КоличествоДней);
	Запрос.УстановитьПараметр("СписокЛС"    , СписокЛС);
	
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаЛС = ЛицевыеСчета.ВыгрузитьКолонки();
	ТаблицаЛС.Колонки.Добавить("КоличествоМесяцев",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	ТаблицаЛС.Колонки.Добавить("ПроцентПени",Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(6,4)));
	ТаблицаЛС.Колонки.Добавить("ПериодНачисленияПени",  Новый ОписаниеТипов("СправочникСсылка.бит_ПериодыНачисленияПени"));
	
	ТаблицаДолгаЛС = ПолучитьТаблицуДолга(Момент, СписокЛС, СсылкаОС);
	
	Если ТаблицаДолгаЛС = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Если СсылкаОС <> Неопределено Тогда
		ТабОстатокСуммы = СсылкаОС.СписокУслуг.Выгрузить(,"ЛицевойСчет, Услуга, Сумма");
		ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
	КонецЕсли;
	
	// Обход лицевых счетов.
	Пока ВыборкаЛС.Следующий() Цикл
		
		кэшЛицевойСчет = ВыборкаЛС.ЛС;
		
		// Переплат.
		Отбор = Новый Структура("ЛицевойСчет", ВыборкаЛС.ЛС);
		ТаблицаПереплат = ТаблицаДолгаЛС.Скопировать(Отбор);
		Если ТаблицаПереплат.Количество() = 0 Тогда
			Продолжить; //Нет данных о долге по ЛС.
		КонецЕсли; 
		ТаблицаПереплат.Свернуть("Услуга, Переплата");
		ПереплатаИтог = ТаблицаПереплат.Итог("Переплата");
		
		// Обход Количества месяцев задолженсти.
		ВыборкаКоличествоМесяцев = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКоличествоМесяцев.Следующий() Цикл
			
			Отбор = Новый Структура("ЛицевойСчет, КоличествоМесяцев", ВыборкаКоличествоМесяцев.ЛС, ВыборкаКоличествоМесяцев.КоличествоМесяцев);
			ТаблицаДолга = ТаблицаДолгаЛС.Скопировать(Отбор);
			
			Если ТаблицаДолга.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДолгИтог = ТаблицаДолга.Итог("ДолгДляНачисления");
			Остаток = ДолгИтог - ПереплатаИтог;
			
			Если Остаток < 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = ПереплатаИтог - ДолгИтог;
				Продолжить;
			ИначеЕсли Остаток > 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = 0;
			КонецЕсли; 
			
			// Обход Услуг.
			кэшУслуга = Неопределено;
			ВыборкаУслуг = ВыборкаКоличествоМесяцев.Выбрать();
			Пока ВыборкаУслуг.Следующий() Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", ВыборкаУслуг.ЛС);
				Отбор.Вставить("Услуга"     , ВыборкаУслуг.Услуга);
				
				СтрокаДолга = ТаблицаДолга.НайтиСтроки(Отбор);
				
				Попытка
					
					Долг = СтрокаДолга[0].ДолгДляНачисления;
					Если Долг <= 0 Тогда
						Продолжить;
					КонецЕсли; 
					
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						СсылкаОСОплатаУслуги = 0;
						Если СсылкаОС <> Неопределено Тогда
							Для каждого Строка Из ТабОстатокСуммы Цикл
								Если Строка.ЛицевойСчет = ВыборкаУслуг.ЛС и Строка.Услуга = ВыборкаУслуг.Услуга	Тогда
									СсылкаОСОплатаУслуги = Строка.Сумма;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							Если СсылкаОСОплатаУслуги = 0 Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
	
				Исключение
					
					Продолжить;
					
				КонецПопытки;
				
				
				Если СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
// 4.12.2018 					
//					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						Если Остаток = 0 Тогда
							Прервать;
						КонецЕсли; 
						тмпСумма = Мин(Долг, Остаток);
//					КонецЕсли;
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если тмпСумма > СсылкаОСОплатаУслуги Тогда
							тмпСумма           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -тмпСумма;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
						КонецЕсли;
					КонецЕсли;
					
					НовыяСтрока					  = ТаблицаЛС.Добавить();
					НовыяСтрока.ЛицевойСчет		  = кэшЛицевойСчет;
					НовыяСтрока.Услуга			  = ВыборкаУслуг.Услуга;
					НовыяСтрока.Долг			  = тмпСумма;
					НовыяСтрока.КоличествоДней	  = ВыборкаУслуг.КоличествоДней;
					НовыяСтрока.КоличествоМесяцев = ВыборкаУслуг.КоличествоМесяцев; //Для правльного подсчета долга и суммы при свертке (техническая колонка).
					НовыяСтрока.Сумма			  = Окр(тмпСумма * ВыборкаУслуг.КоличествоДней * (ВыборкаУслуг.ПроцентПени/100),2);
					НовыяСтрока.ПроцентПени		  = ВыборкаУслуг.ПроцентПени;
					НовыяСтрока.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					
					// Списываем с суммы переплаты уже начисленный долг.
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						Остаток = Остаток - тмпСумма;
						кэшУслуга = ВыборкаУслуг.Услуга;
					КонецЕсли;
					
				Иначе
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если Долг > СсылкаОСОплатаУслуги Тогда
							Долг           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -Долг;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
							кэшУслуга = ВыборкаУслуг.Услуга;
						КонецЕсли;
					КонецЕсли;
					
					НовыяСтрока = ТаблицаЛС.Добавить();
					НовыяСтрока.ЛицевойСчет		  = кэшЛицевойСчет;
					НовыяСтрока.Услуга			  = ВыборкаУслуг.Услуга;
					НовыяСтрока.Долг			  = Долг;
					НовыяСтрока.КоличествоДней	  = ВыборкаУслуг.КоличествоДней;
					НовыяСтрока.КоличествоМесяцев = ВыборкаУслуг.КоличествоМесяцев; // Для правльного подсчета долга и суммы при свертке (техническая колонка).
					НовыяСтрока.Сумма			  = Окр(Долг * ВыборкаУслуг.КоличествоДней * (ВыборкаУслуг.ПроцентПени/100),2);
					НовыяСтрока.ПроцентПени		  = ВыборкаУслуг.ПроцентПени;
					НовыяСтрока.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;

				КонецЕсли;
				
			КонецЦикла; // ВыборкаУслуг.
		КонецЦикла; // ВыборкаКоличествоМесяцев.
	КонецЦикла; // ВыборкаЛС.
	
	ТаблицаЛС.Свернуть("Долг, КоличествоДней, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга, КоличествоМесяцев, ПериодНачисленияПени, ПроцентПени", "Сумма");
	ПениПоПериодам.Загрузить(ТаблицаЛС);
	ТаблицаЛС.Свернуть("Долг, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга, ПериодНачисленияПени", "Сумма, КоличествоДней");
	ТаблицаЛС.Свернуть("КоличествоДней, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга, Долг, ПериодНачисленияПени", "Сумма");
	ТаблицаЛС.Свернуть("КоличествоДней, ЛицевойСчет, НомерСтроки, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ, Услуга", "Сумма, Долг");
	ЗаполнениеСчетовКУ(ТаблицаЛС);
	ЛицевыеСчета.Загрузить(ТаблицаЛС);
	
КонецПроцедуры

Функция ПолучитьТаблицуДолга(Момент, ЛицевойСчет, СсылкаОС)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата",		 Момент);
	Запрос.Текст =

	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 0) КАК КоличествоМесяцев
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА
	|				И Процент >= 0) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоИнтервалов = Выборка.Количество(); 
	Если КоличествоИнтервалов = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо настроить периоды начисления пени в регистре сведений Пени по услугам ЖКХ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , Момент);
	Запрос.УстановитьПараметр("ДатаНачала" , Момент);
	Запрос.УстановитьПараметр("ДатаКонца"  , ?(СсылкаОС<> Неопределено,Новый МоментВремени(Дата, СсылкаОС),КонецДня(Дата)));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Запрос.УстановитьПараметр("Ссылка"     , СсылкаОС);
	ТекстОстатки = "";
	ТекстОбороты = "";
	ПервыйЭлемент = Истина;
	ПредыдущийЭлемент = 0;
	ПоследнийМесяц = 1;
		
	Пока Выборка.Следующий() Цикл
		
		КоличествоИнтервалов = КоличествоИнтервалов - 1;
		
		//Остатки.
		Если НЕ ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток";
		
		Если ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + "
			|ПОМЕСТИТЬ ВТ_Остатки ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	НачисленияПоУслугамЖКХОстатки.УслугаЖКХ";
		
		
		//Обороты.
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + 
			";
			|
			|////////////////////////////////////////////////////////////////////////////////";
		Иначе
			ТекстОбороты = ТекстОбороты + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Разовые";
		
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + "
			|ПОМЕСТИТЬ ТаблицаОплаты ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), &ДатаКонца, Регистратор, ЛицевойСчет в (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ";

		
		ПервыйЭлемент = Ложь;
		ПредыдущийЭлемент = Выборка.КоличествоМесяцев;
		
	КонецЦикла; 
	
	// Итоговый текст запроса. Смещаем всю сумму переплат в самый поздний период,
	// где наибольшей процент пени, чтобы уменьшить долг.
	Запрос.Текст = ТекстОстатки + ТекстОбороты +
	";
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазовыеПриход
	|ПОМЕСТИТЬ ВТ_ТекОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	НачисленияПоУслугамЖКХОстатки.УслугаЖКХ,
	|	СУММА(НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ТекОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаНачала, ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХОстатки
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
	|	НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекОстаток.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ КАК УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Переплата
	|ПОМЕСТИТЬ ВР_ВсеПереплаты
	|ИЗ
	|	ВТ_ТекОстаток КАК ВТ_ТекОстаток
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТекОплаты КАК ВТ_ТекОплаты
	|		ПО ВТ_ТекОстаток.ЛицевойСчет = ВТ_ТекОплаты.ЛицевойСчет
	|			И ВТ_ТекОстаток.УслугаЖКХ = ВТ_ТекОплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_ТекОстаток.ЛицевойСчет ЕСТЬ NULL 
	|	И НЕ ВТ_ТекОстаток.УслугаЖКХ ЕСТЬ NULL 
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекОстаток.ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ КАК Долг,
	|	ВР_ВсеПереплаты.Переплата КАК Переплата
	|ПОМЕСТИТЬ ВР_Таб
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОплаты КАК ТаблицаОплаты
	|		ПО ВТ_Остатки.КоличествоМесяцев = ТаблицаОплаты.КоличествоМесяцев
	|			И ВТ_Остатки.ЛицевойСчет = ТаблицаОплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ТаблицаОплаты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ВсеПереплаты КАК ВР_ВсеПереплаты
	|		ПО ВТ_Остатки.ЛицевойСчет = ВР_ВсеПереплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ВР_ВсеПереплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_Остатки.КоличествоМесяцев ЕСТЬ NULL 
	|	И НЕ ВТ_Остатки.ЛицевойСчет ЕСТЬ NULL 
	|	И НЕ ВТ_Остатки.УслугаЖКХ ЕСТЬ NULL 
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ,
	|	ВР_ВсеПереплаты.Переплата
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДельтаТаблица.КоличествоМесяцев) КАК ДельтаТаблицаКоличествоМесяцев,
	|	ВР_Таб.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет КАК ЛицевойСчет,
	|	ВР_Таб.Услуга КАК Услуга,
	|	ВР_Таб.Долг КАК Долг,
	|	ВР_Таб.Переплата КАК Переплата
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ВР_Таб КАК ВР_Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ДельтаТаблица
	|		ПО ВР_Таб.ЛицевойСчет = ДельтаТаблица.ЛицевойСчет
	|			И ВР_Таб.Услуга = ДельтаТаблица.Услуга
	|			И ВР_Таб.КоличествоМесяцев < ДельтаТаблица.КоличествоМесяцев
	|СГРУППИРОВАТЬ ПО
	|	ВР_Таб.КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет,
	|	ВР_Таб.Услуга,
	|	ВР_Таб.Долг,
	|	ВР_Таб.Переплата
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаяТаблица.ЛицевойСчет КАК ЛицевойСчет,
	|	ИтоговаяТаблица.Услуга КАК Услуга,
	|	ИтоговаяТаблица.Долг КАК Долг,
	|	ИтоговаяТаблица.Долг - ЕСТЬNULL(ВР_Таб.Долг, 0) КАК ДолгДляНачисления,
	|	ИтоговаяТаблица.Переплата КАК Переплата
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб
	|		ПО ИтоговаяТаблица.ДельтаТаблицаКоличествоМесяцев = ВР_Таб.КоличествоМесяцев
	|			И ИтоговаяТаблица.ЛицевойСчет = ВР_Таб.ЛицевойСчет
	|			И (ВР_Таб.Услуга = ИтоговаяТаблица.Услуга)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итоговая.КоличествоМесяцев,
	|	ВТ_Итоговая.ЛицевойСчет,
	|	ВТ_Итоговая.Услуга,
	|	ВТ_Итоговая.Долг,
	|	ВТ_Итоговая.ДолгДляНачисления,
	|	ВТ_Итоговая.Переплата
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Итоговая.КоличествоМесяцев";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ(ТабЛицевыеСчета = Неопределено)Экспорт 
	
	Если ТабЛицевыеСчета = Неопределено тогда
		
		СписокЛС = ЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");

		Колонки  = ЛицевыеСчета.ВыгрузитьКолонки().Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ЛицевыеСчета, Колонки, СписокЛС, Организация , Дата,,,Истина);
		
	Иначе
		
		СписокЛС = ТабЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабЛицевыеСчета.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабЛицевыеСчета, Колонки, СписокЛС, Организация , Дата,,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьОснование(Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_НачислениеПениПоЛицевымСчетам.ДокОснование
	|ИЗ
	|	Документ.бит_НачислениеПениПоЛицевымСчетам КАК бит_НачислениеПениПоЛицевымСчетам
	|ГДЕ
	|  бит_НачислениеПениПоЛицевымСчетам.Организация = &Организация
	|	И НЕ бит_НачислениеПениПоЛицевымСчетам.ЗакрытиеПериода
	|	И бит_НачислениеПениПоЛицевымСчетам.ДокОснование = &ДокОснование
	|	И бит_НачислениеПениПоЛицевымСчетам.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Организация"  , Организация);
	Запрос.УстановитьПараметр("ДокОснование" , ДокОснование);
	Запрос.УстановитьПараметр("Ссылка"       , Ссылка);
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Отказ = Истина;
		Текст = "Начисления по : " + ДокОснование + " существует!";
		Заголовок = "Ввод на основании: ";
		# Если Клиент Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ПроверитьОснованиеЗавершение", ЭтотОбъект), Текст,,Заголовок); 
		# Иначе  	
			бит_ОбщегоНазначения.СообщитьОбОшибке(Текст , Отказ, Заголовок, СтатусСообщения.ОченьВажное);
		# КонецЕсли
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьОснованиеЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или.
// Заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить.
	ОбязательныеРеквизитыШапки = "Организация"+?(ЗакрытиеПериода,",Улица",",ДокОснование");
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

// Процедура проверяет правильность заполнения реквизитов документа.
//
Процедура ПроверкаРеквизитовТЧ(ТаблицаОС,СтруктураШапкиДокумента,Отказ, Заголовок) Экспорт
	
	РеквизитыТабСписокУслуг = "Услуга,Сумма"; //через запятую.
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "СписокУслуг", Новый Структура(РеквизитыТабСписокУслуг), Отказ, Заголовок);
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоПени, Отказ, Заголовок)
	
	//11.12.2018
	ТаблицаПоУслугам.Свернуть("ЛицевойСчет, Услуга, Субконто1, Субконто2, Субконто3, СубконтоКУ1, СубконтоКУ2, СубконтоКУ3, СчетАбонента, СчетКУ",
	                                   "Долг, КоличествоДней, Сумма");

	ДатаДока = Дата;
	НачислениеПениПоУсл = Движения.бит_НачислениеПениПоУслугамЖКХ;
	ДопДанныеНачПени    = Движения.бит_ДопДанныеНачисленияПени;
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		Если СтрокаТЧ.Сумма <> 0 Тогда
			
			Движение = НачислениеПениПоУсл.Добавить();
			Движение.Период      = ДатаДока;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			Движение.СуммаПени   = СтрокаТЧ.Сумма;
			
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			
			ДопДанные = ДопДанныеНачПени.Добавить();
			ДопДанные.Период         = ДатаДока;
			ДопДанные.ЛицевойСчет    = СтрокаТЧ.ЛицевойСчет;
			ДопДанные.Услуга         = СтрокаТЧ.Услуга;
			ДопДанные.Долг           = СтрокаТЧ.Долг;
			ДопДанные.КоличествоДней = СтрокаТЧ.КоличествоДней;
			
			// Движения по Хозрасчетному регистру не выполнять.
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Начисление пени по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);
				Проводка.Сумма = СтрокаТЧ.Сумма;
				
				Если СтрокаТЧ.СчетКУ=ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						
						НДС_Ставка = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						
						Проводка.СуммаНУКт = СтрокаТЧ.Сумма - (СтрокаТЧ.Сумма * (НДС_Ставка / (100 + НДС_Ставка)));// БИТ_ЖКХ_05092013_исправлено вместо СтрокаТЧ.Начислено СтрокаТЧ.Сумма.
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДатаДока = Дата;
	НачислениеПоЛьготам = Движения.бит_НачислениеПениПоПериодам;
	Для каждого СтрокаТЧ Из ТаблицаПоПени Цикл
			Движение = НачислениеПоЛьготам.Добавить();
			Движение.Период               = ДатаДока;
			Движение.ЛицевойСчет          = СтрокаТЧ.ЛицевойСчет;
			Движение.Услуга               = СтрокаТЧ.Услуга;
			Движение.ПериодНачисленияПени = СтрокаТЧ.ПериодНачисленияПени;
			Движение.КоличествоДней       = СтрокаТЧ.КоличествоДней;
			Движение.Процент			  = СтрокаТЧ.ПроцентПени;
			Движение.Долг				  = СтрокаТЧ.Долг;
			Движение.Сумма                = СтрокаТЧ.Сумма;
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает значение флага "Начислять пени" из настроек ЖКХ.
//
// Параметры:
//
// Возвращаемое значение:
//   Начислять  - булево.
//
Функция НачислятьПени()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"	    , КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация" , Организация);
	Запрос.Текст  =
	"ВЫБРАТЬ
	|	НастройкаПараметровЖКХСрезПоследних.НачислятьПени КАК Начислять
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК НастройкаПараметровЖКХСрезПоследних";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		
		Начислять = Результат.Получить(Результат.Количество()-1).Начислять;
		
	Иначе
		
		Начислять = Ложь;
		
	КонецЕсли;
	
	Возврат Начислять;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"   ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"        ,"Услуга");
	СтруктураПолей.Вставить("Сумма"         ,"Сумма");
	СтруктураПолей.Вставить("Долг"          ,"Долг");
	СтруктураПолей.Вставить("КоличествоДней","КоличествоДней");
	
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"			,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"				,"Услуга");
	СтруктураПолей.Вставить("ПериодНачисленияПени"	,"ПериодНачисленияПени");
	СтруктураПолей.Вставить("КоличествоДней"		,"КоличествоДней");
	СтруктураПолей.Вставить("ПроцентПени"			,"ПроцентПени");
	СтруктураПолей.Вставить("Долг"					,"Долг");
	СтруктураПолей.Вставить("Сумма"					,"Сумма");
	РезультатЗапросаПоПени = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ПениПоПериодам", СтруктураПолей);
	ТаблицаПоПени		   = РезультатЗапросаПоПени.Выгрузить();
	
	Если НЕ Отказ И НачислятьПени() Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, ТаблицаПоПени, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПерерасчитатьИПровести(Документ, Основание) Экспорт
	
	СтарыйДок = Документ.ПолучитьОбъект();
	СтарыйДок.ДополнительныеСвойства.Вставить("ПовторныйВводНаОсновании",Ложь);
	
	СтарыйДок.Дата            = Основание.Дата;
	СтарыйДок.ДокОснование    = Основание;
	СтарыйДок.Организация     = Основание.Организация;
	СписокЛС                  = Основание.СписокЛС.ВыгрузитьКолонку("ЛицевойСчет");
	СтарыйДок.ЗакрытиеПериода = Ложь;
	
	СтарыйДок.РассчитатьНачисленияПениПоЛицевымСчетам(СписокЛС, Основание);
	
	СтарыйДок.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат СтарыйДок;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Основание = ДанныеЗаполнения;
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.бит_ОплатаКУ") Тогда
		
	Иначе
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
